InformationRegisters/Храм_КнигаУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>Храм_КнигаУчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПриход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументХозяйственнойОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Храм_НаправленияПрихода</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Храм_НаправленияРасхода</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ящик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Храм_Ящики_и_Кружки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Храм_КнигаУчета/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	если ЗначениеЗаполнено(Запись.ДокументХозяйственнойОперации) Тогда
		Запись.Период = НачалоДня(Запись.ДокументХозяйственнойОперации.Дата);
		если  ТипЗнч(Запись.ДокументХозяйственнойОперации) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") 
			или  ТипЗнч(Запись.ДокументХозяйственнойОперации) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет")
			тогда
			ЭтаФорма.Элементы.СуммаРасхода.Видимость = Ложь;
			если не ЗначениеЗаполнено(Запись.СуммаПриход) Тогда 
				
				
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	Храм_КнигаУчета.ДокументХозяйственнойОперации КАК ДокументХозяйственнойОперации,
				|	СУММА(Храм_КнигаУчета.СуммаПриход) КАК СуммаПриход
				|ИЗ
				|	РегистрСведений.Храм_КнигаУчета КАК Храм_КнигаУчета
				|ГДЕ
				|	Храм_КнигаУчета.ДокументХозяйственнойОперации = &ДокументХозяйственнойОперации
				|
				|СГРУППИРОВАТЬ ПО
				|	Храм_КнигаУчета.ДокументХозяйственнойОперации";
				
				Запрос.УстановитьПараметр("ДокументХозяйственнойОперации", Запись.ДокументХозяйственнойОперации);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				
				УжеВведенныеСуммы = 0;
				пока Выборка.Следующий() Цикл
					
					УжеВведенныеСуммы = Выборка.СуммаПриход;
					
				КонецЦикла;
				
				
				
				Запись.СуммаПриход = Запись.ДокументХозяйственнойОперации.СуммаДокумента - УжеВведенныеСуммы;
			КонецЕсли;
		иначеесли  ТипЗнч(Запись.ДокументХозяйственнойОперации) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") 
			или  ТипЗнч(Запись.ДокументХозяйственнойОперации) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета")
			тогда
			ЭтаФорма.Элементы.Ящик.Видимость = Ложь;
			ЭтаФорма.Элементы.СуммаПоступления.Видимость = Ложь;
			если не ЗначениеЗаполнено(Запись.СуммаРасход) Тогда 
				
				
				
				
				
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	Храм_КнигаУчета.ДокументХозяйственнойОперации КАК ДокументХозяйственнойОперации,
				|	СУММА(Храм_КнигаУчета.СуммаРасход) КАК СуммаРасход
				|ИЗ
				|	РегистрСведений.Храм_КнигаУчета КАК Храм_КнигаУчета
				|ГДЕ
				|	Храм_КнигаУчета.ДокументХозяйственнойОперации = &ДокументХозяйственнойОперации
				|
				|СГРУППИРОВАТЬ ПО
				|	Храм_КнигаУчета.ДокументХозяйственнойОперации";
				
				Запрос.УстановитьПараметр("ДокументХозяйственнойОперации", Запись.ДокументХозяйственнойОперации);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				
				УжеВведенныеСуммы = 0;
				пока Выборка.Следующий() Цикл
					
					УжеВведенныеСуммы = Выборка.СуммаРасход;
					
				КонецЦикла;
				
				
				Запись.СуммаРасход = Запись.ДокументХозяйственнойОперации.СуммаДокумента - УжеВведенныеСуммы;
			КонецЕсли		
		иначе
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЯщикПриИзмененииНаСервере()
	
	//если ЗначениеЗаполнено(Запись.Ящик) Тогда
	//	если не ЗначениеЗаполнено(Запись.НаправлениеПрихода) Тогда 
	//		Запись.НаправлениеПрихода = Запись.Ящик.НаправлениеПрихода;
	//	КонецЕсли;
	//	если не ЗначениеЗаполнено(Запись.НаправлениеРасхода) Тогда 
	//		Запись.НаправлениеРасхода = Запись.Ящик.НаправлениеРасхода;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЯщикПриИзменении(Элемент)
	ЯщикПриИзмененииНаСервере();
КонецПроцедуры
